#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Dec  6 12:44:01 2022

@author: efrat
"""

llist = list(range(1,101,2))

print (llist[7])
print (llist[12])
print (len(llist))
print (llist[-1])
print 

print (llist[0])

""" כל השאלות מתייחסות לרשימה המופיעה מעלה.
אין צורך להבין כיצד נוצרה הרשימה """

""" סעיף א'- להדפיס את האיבר באינדקס 7 ו 12 """



""" סעיף ב' - להדפיס את אורך הרשימה """





""" סעיף ג' - להדפיס את האיבר האחרון ברשימה
(לחשוב מה הקשר בין אורך הרשימה לאיבר האחרון) """




""" סעיף ד' - להדפיס את האיבר הראשון ברשימה 
(לחשוב מה האינדקס של האיבר הראשון ) """
